Revit 2026 API

# GridNodeLocation Enumeration

---

Location of a grid node relative to the face boundary. See DividedSurface.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum GridNodeLocation
```
```vb
Public Enumeration GridNodeLocation
```
```cpp
public enum class GridNodeLocation
```
```fsharp
type GridNodeLocation
```

| Member name | Value | Description |
| --- | --- | --- |
| Boundary | 1 |  |
| Exterior | 2 |  |
| Interior | 0 |  |

#### Reference

Autodesk.Revit.DB Namespace